; domain
(define (domain grid)
  (:requirements :strips)
  (:predicates
    ; types
    (place ?x)
    (key ?k)
    (shape ?s)
    ; static predicates
    (conn ?x ?y)
    (key-shape ?k ?s)
    (lock-shape ?x ?s)
    ; fluents
    (at ?k ?x)
    (at-robot ?x)
    (holding ?k)
    (arm-empty)
    (locked ?x)
    (open ?x)
  )

  ; move from ?curpos to adjacent ?nextpos that is open
  (:action move
    :parameters (?curpos ?nextpos)
    :precondition (and (place ?curpos)
                       (place ?nextpos)
                       (conn ?curpos ?nextpos)
                       (at-robot ?curpos)
                       (open ?nextpos))
    :effect (and (at-robot ?nextpos)
                 (not (at-robot ?curpos))))

  ; pick ?key that is at ?curpos when not holding another key
  (:action pickup
    :parameters (?curpos ?key)
    :precondition (and (place ?curpos)
                       (key ?key)
                       (at ?key ?curpos)
                       (at-robot ?curpos)
                       (arm-empty))
    :effect (and (holding ?key)
                 (not (at ?key ?curpos))
                 (not (arm-empty))))

  ; pick ?newkey at ?curpos while holding/dropping ?oldkey (equiv. to putdown followed by pickup)
  (:action pickup-and-loose
    :parameters (?curpos ?newkey ?oldkey)
    :precondition (and (place ?curpos)
                       (key ?newkey)
                       (key ?oldkey)
                       (at ?newkey ?curpos)
                       (at-robot ?curpos)
                       (holding ?oldkey))
    :effect (and (holding ?newkey)
                 (at ?oldkey ?curpos)
                 (not (holding ?oldkey))
                 (not (at ?newkey ?curpos))))

  ; putdown ?key being held at ?curpos
  (:action putdown
    :parameters (?curpos ?key)
    :precondition (and (place ?curpos)
                       (key ?key)
                       (at-robot ?curpos)
                       (holding ?key))
    :effect (and (arm-empty)
                 (at ?key ?curpos)
                 (not (holding ?key))))

  ; unlock ?lockpos adjacent to ?curpos using ?key begin held of matching ?shape
  (:action unlock
    :parameters (?curpos ?lockpos ?key ?shape)
    :precondition (and (place ?curpos)
                       (place ?lockpos)
                       (key ?key)
                       (shape ?shape)
                       (conn ?curpos ?lockpos)
                       (key-shape ?key ?shape)
                       (lock-shape ?lockpos ?shape)
                       (at-robot ?curpos)
                       (locked ?lockpos)
                       (holding ?key))
    :effect (and (open ?lockpos)
                 (not (locked ?lockpos))))
)

; problem
(define (problem grid_maze1_fpl_s3_seed25760_n0)
  (:domain grid)
  (:objects
    p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 p20 p21 p22 p23 p24 p25 p26 p27 p28 p29 p30 p31 p32 p33 p34 p35 p36 p37 p38 p39 p40 p41 p42 p43 p44 p45 p46 p47
    shape0 shape1 shape2
    key0 key1 key2
  )
  (:init
    ; Object types
    (place p0) (place p1) (place p2) (place p3) (place p4) (place p5) (place p6) (place p7) (place p8) (place p9) (place p10) (place p11) (place p12) (place p13) (place p14) (place p15) (place p16) (place p17) (place p18) (place p19) (place p20) (place p21) (place p22) (place p23) (place p24) (place p25) (place p26) (place p27) (place p28) (place p29) (place p30) (place p31) (place p32) (place p33) (place p34) (place p35) (place p36) (place p37) (place p38) (place p39) (place p40) (place p41) (place p42) (place p43) (place p44) (place p45) (place p46) (place p47)
    (shape shape0) (shape shape1) (shape shape2)
    (key key0) (key key1) (key key2)
    ; Open/locked cells
    (open p0) (open p1) (open p2) (open p3) (open p5) (open p6) (open p7) (open p8) (open p9) (open p11) (open p12) (open p13) (open p14) (open p16) (open p17) (open p18) (open p19) (open p20) (open p21) (open p22) (open p23) (open p24) (open p25) (open p26) (open p27) (open p28) (open p29) (open p30) (open p31) (open p32) (open p33) (open p34) (open p35) (open p36) (open p37) (open p38) (open p39) (open p40) (open p41) (open p43) (open p44) (open p45) (open p46) (open p47)
    (locked p4) (locked p10) (locked p15) (locked p42)
    ; Connected cells
    (conn p0 p1)
    (conn p1 p0)
    (conn p1 p2)
    (conn p2 p1)
    (conn p2 p3)
    (conn p3 p2)
    (conn p3 p4)
    (conn p4 p3)
    (conn p4 p5)
    (conn p4 p20)
    (conn p5 p4)
    (conn p5 p6)
    (conn p6 p5)
    (conn p6 p7)
    (conn p7 p6)
    (conn p7 p8)
    (conn p8 p7)
    (conn p8 p9)
    (conn p9 p8)
    (conn p9 p10)
    (conn p10 p9)
    (conn p10 p11)
    (conn p11 p10)
    (conn p11 p12)
    (conn p12 p11)
    (conn p12 p13)
    (conn p13 p12)
    (conn p13 p14)
    (conn p14 p13)
    (conn p14 p15)
    (conn p15 p14)
    (conn p15 p16)
    (conn p16 p15)
    (conn p16 p17)
    (conn p17 p16)
    (conn p17 p18)
    (conn p18 p17)
    (conn p18 p19)
    (conn p19 p18)
    (conn p20 p4)
    (conn p20 p21)
    (conn p21 p20)
    (conn p21 p25)
    (conn p22 p23)
    (conn p22 p28)
    (conn p23 p22)
    (conn p23 p29)
    (conn p24 p25)
    (conn p24 p31)
    (conn p25 p24)
    (conn p25 p21)
    (conn p25 p26)
    (conn p25 p32)
    (conn p26 p25)
    (conn p26 p33)
    (conn p27 p28)
    (conn p27 p34)
    (conn p28 p27)
    (conn p28 p22)
    (conn p28 p29)
    (conn p28 p35)
    (conn p29 p28)
    (conn p29 p23)
    (conn p29 p30)
    (conn p29 p36)
    (conn p30 p29)
    (conn p30 p37)
    (conn p31 p24)
    (conn p31 p32)
    (conn p31 p38)
    (conn p32 p31)
    (conn p32 p25)
    (conn p32 p33)
    (conn p32 p39)
    (conn p33 p32)
    (conn p33 p26)
    (conn p33 p40)
    (conn p34 p27)
    (conn p34 p35)
    (conn p34 p44)
    (conn p35 p34)
    (conn p35 p28)
    (conn p35 p36)
    (conn p35 p45)
    (conn p36 p35)
    (conn p36 p29)
    (conn p36 p37)
    (conn p36 p46)
    (conn p37 p36)
    (conn p37 p30)
    (conn p37 p47)
    (conn p38 p31)
    (conn p38 p39)
    (conn p39 p38)
    (conn p39 p32)
    (conn p39 p40)
    (conn p40 p39)
    (conn p40 p33)
    (conn p40 p41)
    (conn p41 p40)
    (conn p41 p42)
    (conn p42 p41)
    (conn p42 p43)
    (conn p43 p42)
    (conn p43 p44)
    (conn p44 p43)
    (conn p44 p34)
    (conn p44 p45)
    (conn p45 p44)
    (conn p45 p35)
    (conn p45 p46)
    (conn p46 p45)
    (conn p46 p36)
    (conn p46 p47)
    (conn p47 p46)
    (conn p47 p37)
    ; Lock and key shapes
    (lock-shape p15 shape1)
    (lock-shape p4 shape2)
    (lock-shape p10 shape2)
    (lock-shape p42 shape1)
    (key-shape key0 shape0)
    (key-shape key1 shape1)
    (key-shape key2 shape2)
    ; Key placement
    (at key0 p43)
    (at key1 p33)
    (at key2 p3)
    ; Robot placement
    (at-robot p0)
    (arm-empty)
  )
  (:goal (at-robot p19))
)

; plan
1. (move p0 p1)
   deleted: (at-robot p0)
   added: (at-robot p1)
   goals met: 0 of 1
2. (move p1 p2)
   deleted: (at-robot p1)
   added: (at-robot p2)
   goals met: 0 of 1
3. (move p2 p3)
   deleted: (at-robot p2)
   added: (at-robot p3)
   goals met: 0 of 1
4. (pickup p3 key2)
   deleted: (at key2 p3) (arm-empty)
   added: (holding key2)
   goals met: 0 of 1
5. (unlock p3 p4 key2 shape2)
   deleted: (locked p4)
   added: (open p4)
   goals met: 0 of 1
6. (move p3 p4)
   deleted: (at-robot p3)
   added: (at-robot p4)
   goals met: 0 of 1
7. (move p4 p5)
   deleted: (at-robot p4)
   added: (at-robot p5)
   goals met: 0 of 1
8. (move p5 p6)
   deleted: (at-robot p5)
   added: (at-robot p6)
   goals met: 0 of 1
9. (move p6 p7)
   deleted: (at-robot p6)
   added: (at-robot p7)
   goals met: 0 of 1
10. (move p7 p8)
   deleted: (at-robot p7)
   added: (at-robot p8)
   goals met: 0 of 1
11. (move p8 p9)
   deleted: (at-robot p8)
   added: (at-robot p9)
   goals met: 0 of 1
12. (unlock p9 p10 key2 shape2)
   deleted: (locked p10)
   added: (open p10)
   goals met: 0 of 1
13. (move p9 p8)
   deleted: (at-robot p9)
   added: (at-robot p8)
   goals met: 0 of 1
14. (move p8 p7)
   deleted: (at-robot p8)
   added: (at-robot p7)
   goals met: 0 of 1
15. (move p7 p6)
   deleted: (at-robot p7)
   added: (at-robot p6)
   goals met: 0 of 1
16. (move p6 p5)
   deleted: (at-robot p6)
   added: (at-robot p5)
   goals met: 0 of 1
17. (move p5 p4)
   deleted: (at-robot p5)
   added: (at-robot p4)
   goals met: 0 of 1
18. (move p4 p20)
   deleted: (at-robot p4)
   added: (at-robot p20)
   goals met: 0 of 1
19. (move p20 p21)
   deleted: (at-robot p20)
   added: (at-robot p21)
   goals met: 0 of 1
20. (move p21 p25)
   deleted: (at-robot p21)
   added: (at-robot p25)
   goals met: 0 of 1
21. (move p25 p32)
   deleted: (at-robot p25)
   added: (at-robot p32)
   goals met: 0 of 1
22. (move p32 p33)
   deleted: (at-robot p32)
   added: (at-robot p33)
   goals met: 0 of 1
23. (pickup-and-loose p33 key1 key2)
   deleted: (holding key2) (at key1 p33)
   added: (holding key1) (at key2 p33)
   goals met: 0 of 1
24. (move p33 p32)
   deleted: (at-robot p33)
   added: (at-robot p32)
   goals met: 0 of 1
25. (move p32 p25)
   deleted: (at-robot p32)
   added: (at-robot p25)
   goals met: 0 of 1
26. (move p25 p21)
   deleted: (at-robot p25)
   added: (at-robot p21)
   goals met: 0 of 1
27. (move p21 p20)
   deleted: (at-robot p21)
   added: (at-robot p20)
   goals met: 0 of 1
28. (move p20 p4)
   deleted: (at-robot p20)
   added: (at-robot p4)
   goals met: 0 of 1
29. (move p4 p5)
   deleted: (at-robot p4)
   added: (at-robot p5)
   goals met: 0 of 1
30. (move p5 p6)
   deleted: (at-robot p5)
   added: (at-robot p6)
   goals met: 0 of 1
31. (move p6 p7)
   deleted: (at-robot p6)
   added: (at-robot p7)
   goals met: 0 of 1
32. (move p7 p8)
   deleted: (at-robot p7)
   added: (at-robot p8)
   goals met: 0 of 1
33. (move p8 p9)
   deleted: (at-robot p8)
   added: (at-robot p9)
   goals met: 0 of 1
34. (move p9 p10)
   deleted: (at-robot p9)
   added: (at-robot p10)
   goals met: 0 of 1
35. (move p10 p11)
   deleted: (at-robot p10)
   added: (at-robot p11)
   goals met: 0 of 1
36. (move p11 p12)
   deleted: (at-robot p11)
   added: (at-robot p12)
   goals met: 0 of 1
37. (move p12 p13)
   deleted: (at-robot p12)
   added: (at-robot p13)
   goals met: 0 of 1
38. (move p13 p14)
   deleted: (at-robot p13)
   added: (at-robot p14)
   goals met: 0 of 1
39. (unlock p14 p15 key1 shape1)
   deleted: (locked p15)
   added: (open p15)
   goals met: 0 of 1
40. (move p14 p15)
   deleted: (at-robot p14)
   added: (at-robot p15)
   goals met: 0 of 1
41. (move p15 p16)
   deleted: (at-robot p15)
   added: (at-robot p16)
   goals met: 0 of 1
42. (move p16 p17)
   deleted: (at-robot p16)
   added: (at-robot p17)
   goals met: 0 of 1
43. (move p17 p18)
   deleted: (at-robot p17)
   added: (at-robot p18)
   goals met: 0 of 1
44. (move p18 p19)
   deleted: (at-robot p18)
   added: (at-robot p19)
   goals met: 1 of 1
